controllers/api/MobileController.php

UPDATE `users` SET `updated_at`=1662753775, `access_token`='hqDIFJ-iau8nF5NXPZYtcRjQUlrVZNE7' WHERE `id`=1
---
    public function actionLogin() {

        $post = Yii::$app->request->post();
        $model = new LoginForm();

        if (isset($post["username"]) && isset($post["password"]) && isset($post["token"])) {
            $model->username = $post["username"];
            $model->password = $post["password"];
            if ($model->login()) {
                $user = $model->getUser();
                $user->generateAccessToken();
                $user->save();

SELECT EXISTS(SELECT * FROM `rooms` WHERE `rooms`.`id`='385')
SELECT * FROM `users` WHERE `id`='1'
SELECT EXISTS(SELECT * FROM `users` WHERE `users`.`id`='1')
---
    public function actionAddComment() {

        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            if (isset($_POST['userId']) && isset($_POST['postId']) && isset($_POST['text'])) {
                $userId = $_POST["userId"];
                $postId = $_POST["postId"];
                $text = $_POST["text"];

                $comment = new Comment();
                $comment->r_room = $postId;
                $comment->r_user = $userId;
                $comment->c_text = $text;
                if ($comment->save()) {
                    $userThatMakeComment = Users::findOne(["id" => $userId]);
                    $notification = new NotificationForm();
                    $notification->subject = $userThatMakeComment->fullname;
                    $notification->message = $text;

                    $room = Rooms::findOne(["id" => $postId]);
                    $userRoomOwner = Users::findOne(["id" => $room->r_admin]);

SELECT DISTINCT(users.token) FROM `comment` join `users` ON users.id = comment.r_user WHERE (`r_room`='385') AND (comment.r_user != 20)
---
                    $myNotificationModel->save();
                    $commentsUsersIds = [];
                    if ($userRoomOwner->id != $userId) {
                        $commentsUsersIds = Comment::find()
                                ->select("DISTINCT(users.id)")
                                ->where([
                                    "r_room" => $postId,
                                ])
                                ->andWhere("comment.r_user != $userRoomOwner->id")
                                ->join("join", "users", "users.id = comment.r_user")
                                ->asArray()
                                ->column();

SELECT `comment`.*, `users`.`fullname`, `users`.`profile_picture` FROM `comment` join `users` ON comment.r_user = users.id WHERE `r_room`='385' ORDER BY `creation_date` DESC
---
    public function actionGetCommentsByPost() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            if (isset($_POST['postId'])) {
                $postId = $_POST["postId"];
                $commentsByPost = (new Query)
                        ->select(Comment::tableName() . ".*,users.fullname,users.profile_picture")
                        ->from(Comment::tableName())
                        ->where([
                            "r_room" => $postId
                        ])
                        ->join("join", "users", Comment::tableName() . ".r_user = users.id")
                        ->orderBy("creation_date Desc")
                        ->all();

SELECT * FROM `games`
---
    public function actionGetGames() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            $games = (new Query)
                    ->select("*")
                    ->from("games")
                    ->all();

SELECT COUNT(*) FROM `notificaion` WHERE (`reciever_id`='1') AND (`is_read`=0)
---
    public function actionGetUnreadNotificationNumber() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            $post = Yii::$app->request->post();

            $userId = $post["userId"];
            $count = Notificaion::find()
                    ->where(['reciever_id' => $userId, 'is_read' => 0])
                    ->asArray()
                    ->count();