controllers/api/MobileController.php

                $room->game = $gameId;
                $room->creation_date = date("Y-m-d H:i:s");
                if ($category == "challenge") {
                    $creatorUser = Users::findOne(["id" => $user]);
---
SELECT * FROM `users` WHERE `id`='1'

    public function actionGetProUserPostsForProfile() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            if (isset($_POST['userId'])) {
                $userId = $_POST["userId"];
                $posts = ProUserPosts::find()
                        ->select("pro_user_posts.*,users.fullname,users.profile_picture")
                        ->join('join', 'users', 'users.id = pro_user_posts.user_id')
                        ->where(['user_id' => $userId])
                        ->andWhere('creation_date >= now() - INTERVAL 1 DAY')
                        ->orderBy('creation_date DESC')
                        ->asArray()
                        ->all();
---
SELECT `pro_user_posts`.*, `users`.`fullname`, `users`.`profile_picture` FROM `pro_user_posts` join `users` ON users.id = pro_user_posts.user_id WHERE (`user_id`='1') AND (creation_date >= now() - INTERVAL 1 DAY) ORDER BY `creation_date` DESC

    public function actionFollow() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            if (isset($_POST['r_room']) && isset($_POST['r_user']) && isset($_POST['token'])) {
                $roomId = $_POST["r_room"];
                $userId = $_POST["r_user"];
                $token = $_POST["token"];
                $follow = new Followrooms();
                $follow->r_room = $roomId;
                $follow->r_user = $userId;
                $follow->user_token = $token;
                if ($follow->save()) {

                    $room = Rooms::findOne(["id" => $roomId]);
                    if ($room) {

                        $myNotificationModel = new Notificaion();
                        $myNotificationModel->room_id = $room["id"];
                        $myNotificationModel->sender_id = $userId;
                        $myNotificationModel->reciever_id = $room["r_admin"];
                        $myNotificationModel->description = Constants::$LIKED_YOUR_POST;
                        $myNotificationModel->save();

                        $user = Users::findOne(["id" => $userId]);
---
INSERT INTO `followrooms` (`r_room`, `r_user`, `user_token`) VALUES (385, 1, 'cSBjfpFUSdykzQEK1PPUqY:APA91bH88OEkNX4i4x8dl6g6ix-jJmv9_yJPqlXSnA1dXPL3vfsIcEWuJD7oyvP2oIpbquWuQwfuGmpGOrenLiP4GePzPhaRFX64FYu_lbkqn4A1T1DzgTfDNrcP8P0sT5AHsDiNZf3g')
SELECT EXISTS(SELECT * FROM `rooms` WHERE `rooms`.`id`='385')
SELECT * FROM `rooms` WHERE `id`='385'
INSERT INTO `notificaion` (`room_id`, `sender_id`, `reciever_id`, `description`) VALUES (385, 1, 20, 'liked your post')
SELECT EXISTS(SELECT * FROM `users` WHERE `users`.`id`=20)
SELECT * FROM `users` WHERE `id`='1'

    public function actionUnfollow() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            if (isset($_POST['r_user']) && isset($_POST['r_room'])) {
                $roomId = $_POST["r_room"];
                $userId = $_POST["r_user"];
                $unfollow = Followrooms::find()
                        ->where(["r_room" => $roomId])
                        ->andWhere(["r_user" => $userId])
                        ->one();
                if ($unfollow->delete()) {
---
SELECT * FROM `followrooms` WHERE (`r_room`='385') AND (`r_user`='1')
DELETE FROM `followrooms` WHERE `id`=693

    public function actionGetProfileDataWithFollowers() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            if (isset($_POST["userId"]) && isset($_POST["visitorId"])) {
                $userId = $_POST["userId"];
                $visitorId = $_POST["visitorId"];

                $userProfile = Users::find()
                        ->select("username,fullname,role,link_facebook,link_youtube,link_instagram,link_tiktok,profile_picture,address,email,phone,gender,coins,tags,bio")
                        ->where(['id' => $userId])
                        ->asArray()
                        ->one();

                $games = (new Query)
                        ->select("games.id,games.name,streamer_games.user_id,streamer_games.game_id,streamer_games.game_account_id,streamer_games.id as streamerGameId")
                        ->from("games")
                        ->leftJoin("streamer_games", "games.id = streamer_games.game_id AND streamer_games.user_id = '" . $userId . "'")
                        ->all();

                $userProfile["userGame"] = $games;
//
                $following = Follow::find()
                        ->where(['r_user' => $visitorId])
                        ->andWhere(['r_page' => $userId])
                        ->one();
                if ($following) {
                    $userProfile["following"] = 1;
                } else {
                    $userProfile["following"] = 0;
                }
                $countposts = Rooms::find()
                        ->where(['r_admin' => $userId])
                        ->all();

                $userProfile["numberOfPosts"] = sizeof($countposts);

                $count = Follow::find()
                        ->where(['r_page' => $userId])
                        ->asArray()
                        ->all();

                $userProfile["numberOfFollowers"] = sizeof($count);

                $userNotifications = UserNotifications::find()
                                ->where(['user_id' => $userId])->one();
---
SELECT `username`, `fullname`, `role`, `link_facebook`, `link_youtube`, `link_instagram`, `link_tiktok`, `profile_picture`, `address`, `email`, `phone`, `gender`, `coins`, `tags`, `bio` FROM `users` WHERE `id`='25'
SELECT `games`.`id`, `games`.`name`, `streamer_games`.`user_id`, `streamer_games`.`game_id`, `streamer_games`.`game_account_id`, `streamer_games`.`id` AS `streamerGameId` FROM `games` LEFT JOIN `streamer_games` ON games.id = streamer_games.game_id AND streamer_games.user_id = '25'
SELECT * FROM `follow` WHERE (`r_user`='1') AND (`r_page`='25')
SELECT * FROM `rooms` WHERE `r_admin`='25'
SELECT * FROM `follow` WHERE `r_page`='25'
SELECT * FROM `user_notifications` WHERE `user_id`='25'

    public function actionGetGames() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            $games = (new Query)
                    ->select("*")
                    ->from("games")
                    ->all();
---
SELECT * FROM `games`

    public function actionUpdateToken() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            if (isset($_POST['userId']) && isset($_POST['token'])) {
                $userId = $_POST["userId"];
                $token = $_POST["token"];
                $user = Users::findOne(["id" => $userId]);
---
SELECT * FROM `users` WHERE `id`='1'

    public function actionGetUnreadNotificationNumber() {
        $request = Yii::$app->request;
        if ($request->get('access-token') != '--') {
            $post = Yii::$app->request->post();

            $userId = $post["userId"];
            $count = Notificaion::find()
                    ->where(['reciever_id' => $userId, 'is_read' => 0])
                    ->asArray()
                    ->count();
---
SELECT COUNT(*) FROM `notificaion` WHERE (`reciever_id`='1') AND (`is_read`=0)

    public function actionMakeUserActive() {
        $post = Yii::$app->request->post();
        $id = $post["id"];

        $user = Users::findOne(["id" => $id]);
---
SELECT * FROM `users` WHERE `id`='1'