controllers/api/MobileController.php

    public function actionLogin() {
        $post = Yii::$app->request->post();

        $password = $post["password"];
        $username = $post["username"];
//        $role = $post["role"];
        $token = $post["token"];

        $user = Users::findOne([
                    'username' => $username,
                    'password' => $password,
//                    'role' => $role
        ]);
---
SELECT * FROM `users` WHERE `id`=20
SELECT EXISTS(SELECT * FROM `users` WHERE `users`.`id`=20)

    public function actionGetProfileDataWithFollowers() {
        $post = Yii::$app->request->post();

        $userId = $post["userId"];
        $visitorId = $post["visitorId"];
//        $userId = 13;
        $userProfile = Users::find()
                ->select("username,fullname,role,link_facebook,link_youtube,link_instagram,link_tiktok,profile_picture,address,email,phone,gender,coins,tags,bio")
                ->where(['id' => $userId])
                ->asArray()
                ->one();

        $games = (new Query)
                ->select("games.id,games.name,streamer_games.user_id,streamer_games.game_id,streamer_games.game_account_id,streamer_games.id as streamerGameId")
                ->from("games")
                ->leftJoin("streamer_games", "games.id = streamer_games.game_id AND streamer_games.user_id = '" . $userId . "'")
                ->all();

        $userProfile["userGame"] = $games;
//        \yii\helpers\VarDumper::dump($userProfile, 10, true);
//
//          $post = Yii::$app->request->post();
        $following = Follow::find()
                ->where(['r_user' => $visitorId])
                ->andWhere(['r_page' => $userId])
                ->one();
---
SELECT `username`, `fullname`, `role`, `link_facebook`, `link_youtube`, `link_instagram`, `link_tiktok`, `profile_picture`, `address`, `email`, `phone`, `gender`, `coins`, `tags`, `bio` FROM `users` WHERE `id`='1'
SELECT `games`.`id`, `games`.`name`, `streamer_games`.`user_id`, `streamer_games`.`game_id`, `streamer_games`.`game_account_id`, `streamer_games`.`id` AS `streamerGameId` FROM `games` LEFT JOIN `streamer_games` ON games.id = streamer_games.game_id AND streamer_games.user_id = '1'
SELECT * FROM `follow` WHERE (`r_user`='1') AND (`r_page`='1')

        } else {
            $userProfile["following"] = 0;
        }
        $countposts = Rooms::find()
                ->where(['r_admin' => $userId])
                ->all();

        $userProfile["numberOfPosts"] = sizeof($countposts);

        $count = Follow::find()
                ->where(['r_page' => $userId])
                ->asArray()
                ->all();

        $userProfile["numberOfFollowers"] = sizeof($count);

        $userNotifications = UserNotifications::find()
                        ->where(['user_id' => $userId])->one();
---
SELECT * FROM `rooms` WHERE `r_admin`='1'
SELECT * FROM `follow` WHERE `r_page`='1'
SELECT * FROM `user_notifications` WHERE `user_id`='1'

    public function actionGetGames() {

        $games = (new Query)
                ->select("*")
                ->from("games")
                ->all();
---
SELECT * FROM `games`

    public function actionVoteForStreamer() {
        $post = Yii::$app->request->post();

        $postId = $post["postId"];
        $streamerId = $post["streamerId"];
        $voterId = $post["voterId"];

        $room = Rooms::findOne(["id" => $postId]);
        if ($room) {
            $deadline = $room["challenge_date"];
            $result = time() - strtotime($deadline);
            if (!$deadline || $result > 0) {
                return [
                    'status' => true,
                    'message' => 'voting period is finished',
                    'data' => ''
                ];
            } else {
                $voteTable = ChallengeVoting::findOne([
                            "post_id" => $postId,
                            "r_user" => $voterId
                ]);
---
SELECT * FROM `users` WHERE `id`='1'

    public function actionGetNotificationsByUser() {

        $post = Yii::$app->request->post();

        $userId = $post["userId"];

        $notifications = Notificaion::find()
                ->select(["notificaion.*", "senderUser.fullname as senderFullname", "senderUser.profile_picture as senderProfilePicture"])
//                ->join('join', 'users as recieverUser', 'recieverUser.id = notificaion.reciever_id')
                ->join('join', 'users as senderUser', 'senderUser.id = notificaion.sender_id')
                ->where(['reciever_id' => $userId])
                ->orderBy("id DESC")
                ->asArray()
                ->all();
---
SELECT `notificaion`.*, `senderUser`.`fullname` AS `senderFullname`, `senderUser`.`profile_picture` AS `senderProfilePicture` FROM `notificaion` join `users` `senderUser` ON senderUser.id = notificaion.sender_id WHERE `reciever_id`='1' ORDER BY `id` DESC

    public function actionGetUnreadNotificationNumber() {


        $post = Yii::$app->request->post();

        $userId = $post["userId"];
        $count = Notificaion::find()
                ->where(['reciever_id' => $userId, 'is_read' => 0])
                ->asArray()
                ->count();
---
SELECT COUNT(*) FROM `notificaion` WHERE (`reciever_id`='1') AND (`is_read`=0)