models/Users.php

    public static function findIdentityByAccessToken($token, $type = null) {
        return static::findOne(['access_token' => $token]);
---
SELECT * FROM `users` WHERE `access_token`='PZeH_xw8EkR1ieRB2GEugODwMZp0Mxia'